{
  "genesis_1": "The Sumerian King List and Babylonian Enuma Elish creation myth parallel elements in Genesis, confirming an ancient Near Eastern context.",
  "genesis_11": "The Ziggurat of Ur, an ancient Mesopotamian temple tower, matches descriptions of the Tower of Babel.",
  "exodus_1": "Egyptian records like the Brooklyn Papyrus confirm Semitic slaves were present in Egypt during the estimated time of Israelite slavery.",
  "exodus_14": "Coral-encrusted chariot wheels found in the Gulf of Aqaba point to a possible Red Sea crossing.",
  "leviticus_11": "The detailed food laws in Leviticus align with ancient Egyptian and Canaanite purity customs, showing contextual historical accuracy.",
  "numbers_22": "The Deir Alla Inscription mentions 'Balaam son of Beor', confirming his historical existence outside the Bible.",
  "deuteronomy_5": "The Ten Commandments align with Hittite treaty forms from the 2nd millennium BCE, affirming its era.",
  "joshua_6": "Excavations at Jericho show collapsed walls consistent with a sudden destruction around 1400 BCE, matching the Biblical account.",
  "judges_4": "Hazor destruction layers discovered by Yigael Yadin align with Judges’ accounts of battle victories.",
  "1_kings_9": "The remains of Solomon’s gates at Hazor, Megiddo, and Gezer match the description of his building projects.",
  "2_kings_18": "The Taylor Prism of Assyrian King Sennacherib confirms the siege of Jerusalem during Hezekiah's reign.",
  "isaiah_36": "The Sennacherib Prism corroborates Isaiah’s account of the Assyrian siege of Jerusalem.",
  "jeremiah_39": "Babylonian chronicles and Nebuchadnezzar II’s inscriptions confirm Jerusalem's destruction in 586 BCE.",
  "ezekiel_26": "The prophecy about Tyre’s destruction aligns with Alexander the Great’s later siege, supported by archaeological remains.",
  "daniel_5": "The Nabonidus Cylinder and other tablets confirm Belshazzar was coregent with his father, as Daniel accurately notes.",
  "jonah_3": "The city of Nineveh has been fully excavated, confirming its immense size and importance as described in Jonah.",
  "matthew_2": "Herod the Great’s fortress palaces and the Massacre of the Innocents align with Herod’s known brutality from historical sources.",
  "matthew_27": "The discovery of a crucified man’s heel bone in Jerusalem proves crucifixion was practiced exactly as described.",
  "luke_2": "Quirinius’ census and Roman administrative practices confirm Luke’s account of registration in Bethlehem.",
  "john_5": "The Pool of Bethesda was discovered in Jerusalem exactly as described in the Gospel of John.",
  "john_19": "The Pilate Stone found in Caesarea confirms the existence of Pontius Pilate as governor.",
  "acts_18": "The Gallio Inscription at Delphi confirms the timeline and presence of Paul in Corinth.",
  "romans_16": "Names listed in Romans match names common in inscriptions from 1st-century Rome.",
  "1_corinthians_8": "Temple inscriptions from Corinth reveal a society full of idols and meat sacrificed to them.",
  "revelation_2": "Archaeological remains of the churches in Ephesus, Smyrna, and Pergamum confirm the locations and practices mentioned."
}
