{
  "genesis_1": "The Sumerian King List and Babylonian Enuma Elish creation myth parallel elements in Genesis, confirming an ancient Near Eastern context.",
  "genesis_11": "The Ziggurat of Ur, an ancient Mesopotamian temple tower, matches descriptions of the Tower of Babel.",
  "genesis_13": "Archaeological surveys and textual analysis suggest the 'cities of the plain' including Sodom were located near the Dead Sea, with Tall el-Hammam being a proposed site for Sodom, showing destruction layers consistent with a catastrophic event.",
  "genesis_general": "The Nuzi Tablets, discovered in northern Iraq, describe social and legal customs (e.g., marriage, adoption, inheritance) that are similar to those described in the patriarchal narratives of Genesis, providing a cultural context.",
  "exodus_1": "Egyptian records like the Brooklyn Papyrus (Papyrus Brooklyn 35.1446) list Semitic names of slaves in Egypt, aligning with the period of Israelite slavery.",
  "exodus_14": "While controversial and not universally accepted, some propose that coral-encrusted chariot wheels found in the Gulf of Aqaba could be evidence of the Red Sea crossing.",
  "leviticus_11": "The detailed food laws in Leviticus align with ancient Near Eastern purity customs and hygiene practices known from Egyptian and Canaanite cultures, showing contextual historical accuracy.",
  "numbers_22": "The Deir Alla Inscription, found in Jordan, is a non-biblical text that mentions 'Balaam son of Beor', a prophet also found in Numbers 22-24, confirming his historical existence.",
  "deuteronomy_5": "The structure of the Ten Commandments and other covenantal texts in Deuteronomy show similarities to Hittite suzerainty treaties from the 2nd millennium BCE, suggesting an authentic historical context for their formulation.",
  "joshua_6": "Excavations at Jericho by John Garstang and later Kathleen Kenyon revealed collapsed walls. While dating is debated, some interpretations align the destruction layer (City IV) with the biblical account of Joshua's conquest around 1400 BCE.",
  "judges_4": "Excavations at Hazor led by Yigael Yadin uncovered destruction layers that correspond to various periods, including one attributed to the Israelites as described in Judges 4 (regarding Deborah and Barak) and Joshua 11.",
  "1stkings_6": "The 'Ain Dara Temple in northern Syria, dating from the 10th to 8th centuries BCE, shares many architectural features with the description of Solomon's Temple in 1 Kings 6, providing a contemporary parallel.",
  "1stkings_9": "Archaeological work at Hazor, Megiddo, and Gezer has revealed impressive six-chambered gates dating to the Solomonic era (10th century BCE), matching the biblical description of King Solomon's building projects (1 Kings 9:15).",
  "2ndkings_18": "The Taylor Prism (or Sennacherib Prism) is an Assyrian annalistic account by King Sennacherib which details his siege of Jerusalem in 701 BCE during the reign of King Hezekiah, corroborating the biblical account in 2 Kings 18-19.",
  "2ndkings_20": "The Siloam Inscription, found in Hezekiah's Tunnel in Jerusalem, commemorates the completion of the tunnel, a project ordered by King Hezekiah (2 Kings 20:20) to secure Jerusalem's water supply before the Assyrian siege.",
  "isaiah_36": "The Sennacherib Prism also corroborates Isaiah’s account (Isaiah 36-37) of the Assyrian siege of Jerusalem and the divine deliverance of the city.",
  "jeremiah_39": "Babylonian Chronicles, specifically the Nebuchadnezzar Chronicle (BM 21946), record the siege and capture of Jerusalem by Nebuchadnezzar II in 597 BCE and its subsequent destruction in 587/586 BCE, aligning with Jeremiah's accounts.",
  "jeremiah_52": "The Lachish Letters, ostraca found at Lachish, provide contemporary accounts from a Judahite military officer during the Babylonian invasion (early 6th century BCE), reflecting the desperate situation described in Jeremiah, particularly around Jeremiah 52.",
  "ezekiel_26": "The prophecy in Ezekiel 26 regarding the destruction of Tyre is supported by historical accounts of multiple sieges, including a partial fulfillment by Nebuchadnezzar II and a more complete destruction of the island city by Alexander the Great in 332 BCE.",
  "daniel_5": "The Nabonidus Cylinder (found in Ur) and other cuneiform texts confirm that Nabonidus, the last king of Babylon, entrusted coregency to his son Belshazzar, who was effectively ruling in Babylon as described in Daniel 5.",
  "jonah_3": "The ancient city of Nineveh, capital of the Assyrian Empire, has been extensively excavated. Its ruins (modern Mosul, Iraq) confirm its vast size and importance, as described in the book of Jonah.",
  "matthew_2": "Historical accounts by Josephus and archaeological findings at Herodium and Jericho confirm Herod the Great's extensive building projects and his reputation for cruelty, providing context for the narrative in Matthew 2, including the Massacre of the Innocents.",
  "matthew_27": "The discovery in 1968 of the heel bone of a crucified man named Yehohanan, found in a 1st-century AD tomb at Giv'at ha-Mivtar in Jerusalem, with a Roman nail still piercing it, confirms the Roman practice of crucifixion as described in the Gospels.",
  "luke_2": "While specific details of Quirinius' census are debated by historians, Roman administrative practices included periodic censuses for taxation and enrollment. Luke's reference to a census under Quirinius (Luke 2:1-3) fits this general historical context.",
  "luke_3": "The Pool of Siloam, mentioned in John 9:7, where Jesus healed the blind man, has been identified and partially excavated in Jerusalem, confirming its existence as described.",
  "john_5": "The Pool of Bethesda in Jerusalem, described in John 5:2-9 with its five porticoes (covered colonnades), was excavated in the 19th and 20th centuries near the Church of St. Anne, matching the biblical description.",
  "john_9": "The Siloam Pool in Jerusalem, where Jesus instructed the man born blind to wash (John 9:6-7), has been identified and is a significant archaeological site. Its discovery lends credence to the Gospel account.",
  "john_19": "The Pilate Stone, an inscription discovered in 1961 at Caesarea Maritima, bears the name 'Pontius Pilatus, Prefect of Judea,' confirming the historical existence and title of the Roman governor who, according to the Gospels, ordered Jesus' crucifixion.",
  "acts_general": "The Tomb of the Apostle Philip is believed by some archaeologists to have been found in Hierapolis, Turkey, a city Philip is associated with in early Christian tradition. This aligns with the expansion of Christianity described in Acts.",
  "acts_13": "Sergius Paulus Inscription: Inscriptions found in Cyprus mention a proconsul named L. Sergius Paullus, who is likely the same official Paul encountered on his first missionary journey (Acts 13:6-12).",
  "acts_17": "Politarch Inscription: An inscription on an arch in Thessaloniki (ancient Thessalonica) uses the rare Greek term 'politarchs' for city officials, the same term Luke uses in Acts 17:6, demonstrating Luke's accuracy in local details.",
  "acts_18": "The Gallio Inscription, discovered at Delphi, Greece, is a letter from the Emperor Claudius that mentions Junius Gallio as proconsul of Achaia. This helps date Paul's stay in Corinth (Acts 18:12-17) to around 51-52 AD.",
  "romans_16": "The Erastus Inscription found in Corinth mentions an 'Erastus, curator of public buildings,' possibly the same Erastus mentioned by Paul in Romans 16:23, who was a city treasurer in Corinth.",
  "1stcorinthians_8": "Inscriptions and archaeological remains from Corinth reveal a city deeply involved in idol worship, with numerous temples and evidence of meat sacrificed to idols, providing context for Paul’s discussion in 1 Corinthians 8.",
  "colossians_4": "The site of ancient Colossae, though not extensively excavated, is known. Its mention in Paul's letter to the Colossians (Colossians 4:13 regarding Epaphras from Colossae) fits the geographical and historical understanding of 1st-century Anatolia.",
  "revelation_2": "Archaeological excavations at Ephesus, Smyrna, Pergamum, Thyatira, Sardis, Philadelphia, and Laodicea (the Seven Churches of Asia Minor mentioned in Revelation 2-3) have revealed significant remains of these Roman-era cities, confirming their existence, cultural contexts, and some of the specific issues John addressed.",
  "revelation_3": "Further details for Revelation 3: See entry for Revelation 2. For example, Laodicea was known for its wealth, banking, textile industry (black wool), and a medical school famous for eye-salve, which aligns with the rebukes and commendations in Revelation 3:14-22."
}
